import type { MenuModel } from './all.type';

export const MENU: MenuModel[] = [
  {
    category: '최근',
    menu: {
      송금: {
        url: '/',
      },
      '내 계좌': {
        url: '/',
      },
      '오늘의 머니 팁': {
        url: '/',
      },
    },
  },
  {
    category: '신규',
    menu: {
      후불결제: {
        url: '/',
      },
      새소식: {
        url: '/',
      },
      '청와대 관람 신청하기': {
        url: '/',
      },
      '증명서 떼기': {
        url: '/',
      },
      '신용카드 한도 비교': {
        url: '/',
      },
    },
  },
  {
    category: '대출',
    menu: {
      '대출 받기': {
        url: '/',
      },
      '토스뱅크 대출 알아보기': {
        url: '/',
      },
      '주택담보대출 찾기': {
        url: '/',
      },
      현금서비스: {
        url: '/',
      },
      '아파트 대출한도 계산기': {
        url: '/',
      },
    },
  },
  {
    category: '보험',
    menu: {
      '내 보험': {
        url: '/',
      },
      '전문가에게 물어보기': {
        url: '/',
      },
      '병원비 돌려받기': {
        url: '/',
      },
      '보험 둘러보기': {
        url: '/',
      },
    },
  },
  {
    category: '송금',
    menu: {
      송금: {
        url: '/',
      },
      '내 토스아이디': {
        url: '/',
      },
      '사진으로 송금': {
        url: '/',
      },
      더치페이: {
        url: '/',
      },
      자동이체: {
        url: '/',
      },
    },
  },
  {
    category: '결제',
    menu: {
      후불결제: {
        url: '/',
      },
    },
  },
  {
    category: '계좌',
    menu: {
      '내 계좌': {
        url: '/',
      },
      '숨은 내 계좌 찾기': {
        url: '/',
      },
      '계좌 만들기': {
        url: '/',
      },
      '토스뱅크 연 2% 통장 만들기': {
        url: '/',
      },
      '돈 같이 모으기': {
        url: '/',
      },
    },
  },
  {
    category: '신용',
    menu: {
      '내 신용점수': {
        url: '/',
      },
      '신용점수 올리기': {
        url: '/',
      },
    },
  },
  {
    category: '카드',
    menu: {
      '내 카드': {
        url: '/',
      },
      '카드 알림': {
        url: '/',
      },
      '혜택 좋은 신용카드 만들기': {
        url: '/',
      },
      '혜택 좋은 체크카드 만들기': {
        url: '/',
      },
      '신용카드 한도 비교': {
        url: '/',
      },
      토스뱅크카드: {
        url: '/',
      },
      '토스신용카드 만들기': {
        url: '/',
      },
    },
  },
  {
    category: '자동차',
    menu: {
      '내 차 시세': {
        url: '/',
      },
      '차 보험료 조회': {
        url: '/',
      },
      '내 차 팔기': {
        url: '/',
      },
    },
  },
  {
    category: '부동산',
    menu: {
      '내 부동산 시세조회': {
        url: '/',
      },
      '내 아파트 관리비': {
        url: '/',
      },
    },
  },
  {
    category: '토스 주민센터',
    menu: {
      '청와대 관람 신청하기': {
        url: '/',
      },
      '증명서 떼기': {
        url: '/',
      },
    },
  },
  {
    category: '혜택',
    menu: {
      만보기: {
        url: '/',
      },
      토스프라임: {
        url: '/',
      },
      '카드 이벤트 상품': {
        url: '/',
      },
      '결제할 때 할인받기': {
        url: '/',
      },
    },
  },
  {
    category: '생활',
    menu: {
      '숨은 정부지원금 찾기': {
        url: '/',
      },
      오픈채팅방: {
        url: '/',
      },
      '광고 전화 차단하기': {
        url: '/',
      },
      '상품권 구매하기': {
        url: '/',
      },
      'KT 통신비 내기': {
        url: '/',
      },
      'ATM 현금 찾기': {
        url: '/',
      },
      환전: {
        url: '/',
      },
      '오늘의 머니 팁': {
        url: '/',
      },
      '정치후원금 보내기': {
        url: '/',
      },
      '공모주 청약 일정': {
        url: '/',
      },
    },
  },
  {
    category: '사장님',
    menu: {
      '내 매출 장부': {
        url: '/',
      },
      '급여명세서 보내기': {
        url: '/',
      },
      '배달 매출 늘리기': {
        url: '/',
      },
      '세금계산서 알림 받기': {
        url: '/',
      },
      '숨은 카드매출 찾기': {
        url: '/',
      },
      '세금계산서 발행하기': {
        url: '/',
      },
    },
  },
];
